/*  1 . რა არის ცვლადი (variable)?

ცვლადი არის კონტეინერი სადაც შეგვიძლია შევინახოთ რაიმე მონაცემი 
ანუ რაიმე მნიშვნელობა  ნებისმიერი სახის ( სახელი , გვარი , ასაკი , ქვეყანა ...)  
.ცვლადს შეგვიძლია დავარქვათ ის სახელი რაც ჩვენ მოგვესურვება მაგრამ 
 უმჯობესია ცვლადის სახელი იყოს ამ ცვლადში შენახული მონაცემის შესაბამისი .


	1. ცვლადი ინახავს მნიშვნელობას .
	2. მის გამოსაცხადებლად გვჭირდება  საკვანძო სიტყვები   var , let , const.
	3. მინიჭების ოპერატორით ანუ ტოლობით ცვლადს ვანიჭებთ მნიშვნელობას .
	4. Const  მუდმივი უცვლელი ცვლადია .*/
  
  //მაგ:

let  firstName = "nata"
console.log(firstName)

/*ამ მაგალითში let არის საკვანძო სიტყვა.  ხოლო ცვლადი ანუ კონტეინერი არის firstName  
 მინიჭების ოპერატორის რაც ამ შემთხვევაში გამოიხატება ტოლობით  =   ვანჭებთ მნიშვნელობას , 
 მნიშვნელობა ამ მაგალითში არის nata ანუ ცვლადმა firstName  
 შეინა ხა მნიშვნელობა (მიანიჭა მნიშვნელობა ) 
 nata .*/



/* fiestName  არის ცვლადი , კონტეინერი, ყუთი  */ 



/*  2 . რა არის მინიჭების ოპერატორი (assignment operator)?


js ში  მინიჭების ოპერატორი არის = ტოლობის ნიშანი , ხოლო ტოლობა როგორც თავისივე  მნიშვნელობა
js ში გამოიყენება ორის სახით == ჩვეულებრივი ტოლობა და === მკაცრი ტოლობა
 (უმჯიობესია გამოვიყენოთ მკაცრი ტოლობა)
/*


/*  3 . რა არის მნიშვნელობა (value)?


/*



/* 4 . რას ეწოდება კოდის ბლოკი (code block)?

ჯავასკრიპტში კოდის ბლოკი განისაზღვრება ფიგურული ბრჩხილებით   
{  მასში მოქცეულია ჩვენს მიერ გაკეთებული განცხადება განცხადებები }  
კოდის ბლოკში ჩვენ შეგვიძლია მოვაქციოთ  რამდენიმე განცხადება*/

//console.log(){
   // 1 gancxadeba
   // 2 gancxadeba
//}
 /*სადაც ეს ორი განცხადებაა მოქცეული ფიგურული პრცხილების შორის მას ეწოდება კოდის ბლოკი/*
 
  




 /*რა არის [if | else | else if]? 
 

  თვითონს if განისაზღვრება როგორც სიტყვა "თუ " ის js ში განისაზღვრება როგორც "თუ" პირობა 
  შესრულდება ( პორობა if ის შემთხვევაში იწერება კოდის ბლოკში {  } )
 */
  //if 
let age = 27
let fiestName= "doi"

if (age >= 18 & fiestName === "doi"){
    console.log('hello doi')
}

//else
/*ელს მოქმედებს მაშინ თუ ზემოთ მოცემული პირობა if ის შემთხვევაში არ შესრულდება   ანუ თუ if ის
 კოდის ბლოკში მოთავსებული პირობა არ შესრულდება მაში შესრულდეს else ის კოდის ბლოში მოთავსებული პირობა .

მაგ 

let age = 27
let fiestName= "doi"
if (age >= 18 & fiestName === "dol"){
    console.log('hello doi')
} else {
    console.log("hello zvio")
}


ამ მაგალითის მიხედვით იფის კოდის ბლოკში მოთავსებული პირობა არ შესრულდა რადგან firstName 
 რეალურად არის doi ხოლო კოდის ბლოკშკი არის დოლ და რადგანაც არ შესრულდა იფი დაა else ნიშნავს იმას რომ, 
 თუ if არ შესრულდებოდა შესრულებულიყო ელსის პირობა ამიტომ კონსოლ ლოგსი გამოვა hello zvio.
Else ის შემთხვევაში არ ვქმნით ახალ პირობას ისს მხოლოდ რეაგირებს ძველი პირობის არ შესრულების შემთხვევაში. 


*/

//else if 
/*Else if  გამოიყენებაა ახალიი პირიბისს დასადასტურებლად და მისი გამოყენებითვის ჩვენ უნდა
 შეევქმნათ ახალი პირიბა განსხვავებით ელსისგან სადაც არ ვქმნითახალ პირობას .

მაგ 

let age = 27
let fiestName= "doi"
if (age >= 18 & fiestName === "dol"){
    console.log('hello doi')
} else if (age < 30 & fiestName === "doi"){
    console.log("yes")
} else {
    console.log("no")
}

 ამ შემთხვევაში როცა არ დადასტურდა if ის კოდის ბლოკში არსებული პირობა js 
 განაგრძობს კოდის წაკითხვას და else if ში არსებული პირობა დადასტურდება რადგან ასაკი ნამდვილად ნაკლებია 30 ზე 
  რადგან ცვლადში ასაკი მითითებული გვაქვს 27 ხოლო სახელი ცვლადში მითითებული გვაქვს დოი და else if ის ბლოკშიც სახელი დოია  
  ამიტომ ეს პირობაა ჭეშმარიტია დაა კონსოლში მივიღებთ პასუხს yes , მაგრამ თუ არც if ის პირობა და არც else if 
  ის პირობა არ შესრულდებოდა ამ მაგალითში აუცილებლად შესრულდებოდა else პირობა და კონსოლსი მივიღებთით No პრინტს  .

*/


//როგორ მუშაობს: [და, ან, არა] ოპერატორები (and, or, not)?/

